/* ==============================================================================================================================
 타입 정의 시 자주 사용될 것 같은 기능성 타입을 정의한다
============================================================================================================================== */

// 특정 속성명을 사용할 수 없는 오브젝트
type ExcludeKey<T, K extends keyof T> = {
  [P in Exclude<keyof T, K>]: T[P];
};

// 임의의 오브젝트의 속성명들을 유니언 타입으로 정의
type Keyof<T extends Record<string, any>> = keyof T;

export type { ExcludeKey, Keyof };